#include <iostream>
#include <cmath>
using namespace std;

//در یکی از روزهای آرام در حالی که هیچ اتفاق عجیبی رخ نمی‌داد، ریک در حال آزمایش بود که ناگهان خودش و مورتی را به یک دنیای دو بعدی منتقل کرد. آنها در حال ماجرا جویی بودند که ریک توسط یک فضایی در دنیای دو بعدی دستگیر شد. حال مورتی باید با استفاده از کامپیوتر ریک، آنها را به فضایی سه بعدی منتقل کند. اما از آنجایی که زیاد با هوش نیست، توسط سفینه ریک با شما تماس گرفته که به او کمک کنید. شما باید برای آنها یک برنامه به زبان سی پلاس پلاس بنویسید. برای این کار لازم است ابتدا یک struct با سه ویژگی x و y و z تعریف کنید.سپس تابع زیر را برای آن تعریف کنید. تابع مطلوب: این تابع دو نقطه از جنس struct را در پارامترهای خود گرفته و فاصله‌ی اقلیدسی دو نقطه را با سه تا سه عدد اعشاری محاسبه می‌کند.

struct dot{
    int x,y,z;
};

float distance(dot a, dot b)
{
    float d= sqrt((a.x-b.x)*(a.x-b.x) + (a.y-b.y)*(a.y-b.y) + (a.z-b.z)*(a.z-b.z));
    return d;
}

int main() {
    struct dot a;
    struct dot b;
    cin >> a.x >> a.y >> a.z;
    cin >> b.x >> b.y >> b.z;

    printf("%.3f", distance(a, b));


    return 0;
}
